print('-----------VACCINED Program-------------')
name = str(input(">>>>>>ระบุชื่อ-นามสกุลของท่าน :"))
age= str(input(">>>>>ระบุอายุของท่าน : "))
print('<<<<<<<โรคประจำตัว>>>>>>>>>')
set1 = {'1.โรคหัวใจ', '2.ความดัน', '3.เบาหวาน', '4.เเพ้ยา', '5.หอบ','6.ไม่มีโรคประจำตัวใดๆ'}
for data in set1:
    print(data, end="\n")
# (ใส่เงื่อนไข)

type=int(input(">>>>>>>>>>ประเภทของโรค :"))
print("ชื่อ-นามสกุล : {}, อายุ {},ประเภทของโรค {}".format(name,age,type))
# เงื่อนไขที่2
check=0
while check!='Y'and check!='N' :
    check=str(input(" ท่านได้ตั้งครรภ์หรือไม่ ถ้าใช่ให้พิม Y ถ้าไม่ใช่ให้ พิม N>>>>>>>>>>"))


# เงื่อนไขที่ 3
check2=0
while check2!='Y'and check2!='N' :    
    check2=str(input(" ท่านได้ผ่านการฉีดวัคซีนหรือไม่ ถ้าใช่ให้พิม Y ถ้าไม่ใช่ให้ พิม N>>>>>>>>>>"))


